# questions.py

QUIZ_QUESTIONS = [
    # Керівники
    {"question": "Як звати Head відділу HR?", "options": ["Ганькович Інеса", "Сільвія Онисько", "Роман Бобинич"], "answer": "Ганькович Інеса"},
    {"question": "Хто Planning lead?", "options": ["Сільвія Онисько", "Гала Сергій", "Дугінова Евгенія"], "answer": "Сільвія Онисько"},
    {"question": "Хто відповідає за охорону праці?", "options": ["Роман Бобинич", "Соловка Юрій", "Галузінська Вероніка"], "answer": "Роман Бобинич"},
    {"question": "Хто менеджер з якості?", "options": ["Галузінська Вероніка", "Деде Петро", "Хмельниченко Сергій"], "answer": "Галузінська Вероніка"},
    {"question": "Хто EV?", "options": ["Деде Петро", "Недоля Володимир", "Юрченко Олександр"], "answer": "Деде Петро"},
    {"question": "Хто аналітик?", "options": ["Недоля Володимир", "Дугінова Евгенія", "Сплавінська Юлія"], "answer": "Недоля Володимир"},
    {"question": "Хто відповідає за складську логістику?", "options": ["Дугінова Евгенія", "Тернущак Василина", "Бойчук Анастасія"], "answer": "Дугінова Евгенія"},
    {"question": "Хто Head SMT?", "options": ["Гала Сергій", "Яремчук Сергій", "Косей Михайло"], "answer": "Гала Сергій"},
    {"question": "Хто керує монтажем?", "options": ["Тернущак Василина", "Бойчук Анастасія", "Хмельниченко Сергій"], "answer": "Тернущак Василина"},
    {"question": "Хто керує напівфабрикатом?", "options": ["Бойчук Анастасія", "Сплавінська Юлія", "Левченко Данило"], "answer": "Бойчук Анастасія"},
    {"question": "Хто Debug and Repair?", "options": ["Хмельниченко Сергій", "Юрченко Олександр", "Деде Петро"], "answer": "Хмельниченко Сергій"},
    {"question": "Хто відповідає за готову продукцію?", "options": ["Сплавінська Юлія", "Юрченко Олександр", "Бойчук Анастасія"], "answer": "Сплавінська Юлія"},
    {"question": "Хто керує Workcell камерами?", "options": ["Юрченко Олександр", "Левченко Данило", "Хмельниченко Сергій"], "answer": "Юрченко Олександр"},
    {"question": "Хто керує Workcell fire?", "options": ["Левченко Данило", "Яремчук Сергій", "Косей Михайло"], "answer": "Левченко Данило"},
    {"question": "Хто Production Manager?", "options": ["Яремчук Сергій", "Косей Михайло", "Гала Сергій"], "answer": "Яремчук Сергій"},
    {"question": "Хто Plant Manager?", "options": ["Косей Михайло", "Яремчук Сергій", "Сплавінська Юлія"], "answer": "Косей Михайло"}
]

INTERVIEW_QUESTIONS = [
    # Департаменти і дільниці
    {"question": "Які дільниці входять у департамент SMT?", "options": ["SMT"], "answer": "SMT"},
    {"question": "Які дільниці входять у департамент Монтаж?", "options": ["Селективка-DIP-Laq"], "answer": "Селективка-DIP-Laq"},
    {"question": "Які дільниці входять у департамент Напівфабрикат?", "options": ["Test-Складання"], "answer": "Test-Складання"},
    {"question": "Які дільниці входять у департамент Debug and Repair?", "options": ["Assembly Rework-Debug"], "answer": "Assembly Rework-Debug"},
    {"question": "Які дільниці входять у департамент Готової продукції?", "options": ["Лонг тест-QC/PKG-Мастербокс-Тамподрук-Комплектування"], "answer": "Лонг тест-QC/PKG-Мастербокс-Тамподрук-Комплектування"}
]
