questions = [
    {
        "text": "Хто має повідомити HR Lead локації про прогул працівника?",
        "options": [
            ("Head of Department", False),
            ("HR Documentation Specialist", False),
            ("Безпосередній керівник", True)
        ]
    },
    {
        "text": "Який документ складає керівник, якщо працівник не вийшов на роботу і відмовляється писати пояснювальну?",
        "options": [
            ("Доповідна записка", False),
            ("Акт відмови надати пояснення", True),
            ("Табель", False)
        ]
    },
    {
        "text": "Хто формує комісію та проводить розслідування інциденту?",
        "options": [
            ("HR Lead локації", True),
            ("Безпосередній керівник", False),
            ("Head of Department", False)
        ]
    },
    {
        "text": "Що має зробити безпосередній керівник, якщо працівник прийшов на роботу в нетверезому стані?",
        "options": [
            ("Повідомити службу безпеки, скласти доповідну, відсторонити від роботи", True),
            ("Повідомити тільки HR Lead", False),
            ("Взяти пояснювальну записку і залишити працювати", False)
        ]
    },
    {
        "text": "Хто повинен проводити бесіду з працівником після отримання пояснювальної записки про прогул?",
        "options": [
            ("HR Documentation Specialist", False),
            ("Безпосередній керівник та HR Lead локації", True),
            ("Head of Department", False)
        ]
    },
    {
        "text": "Які дії безпосереднього керівника при систематичних запізненнях або залишенні робочого місця без погодження?",
        "options": [
            ("Ігнорувати", False),
            ("Фіксація порушень, повідомлення HR Lead, пояснювальна записка", True),
            ("Скласти акт відсторонення без повідомлення", False)
        ]
    },
    {
        "text": "Як звати Head відділу HR?",
        "options": [
            ("Сільвія Онисько", False),
            ("Ганькович Інеса", True),
            ("Роман Бобинич", False)
        ]
    },
    {
        "text": "Хто Planning lead?",
        "options": [
            ("Дугінова Евгенія", False),
            ("Гала Сергій", False),
            ("Сільвія Онисько", True)
        ]
    },
    {
        "text": "Хто відповідає за охорону праці?",
        "options": [
            ("Роман Бобинич", True),
            ("Соловка Юрій", False),
            ("Галузінська Вероніка", False)
        ]
    },
    {
        "text": "Хто менеджер з якості?",
        "options": [
            ("Деде Петро", False),
            ("Хмельниченко Сергій", False),
            ("Галузінська Вероніка", True)
        ]
    },
    {
        "text": "Хто EV?",
        "options": [
            ("Юрченко Олександр", False),
            ("Деде Петро", True),
            ("Недоля Володимир", False)
        ]
    },
    {
        "text": "Хто аналітик?",
        "options": [
            ("Сплавінська Юлія", False),
            ("Недоля Володимир", True),
            ("Дугінова Евгенія", False)
        ]
    },
    {
        "text": "Хто відповідає за складську логістику?",
        "options": [
            ("Дугінова Евгенія", True),
            ("Бойчук Анастасія", False),
            ("Тернущак Василина", False)
        ]
    },
    {
        "text": "Хто Head SMT?",
        "options": [
            ("Яремчук Сергій", False),
            ("Гала Сергій", True),
            ("Косей Михайло", False)
        ]
    },
    {
        "text": "Хто керує монтажем?",
        "options": [
            ("Хмельниченко Сергій", False),
            ("Тернущак Василина", True),
            ("Бойчук Анастасія", False)
        ]
    },
    {
        "text": "Хто керує напівфабрикатом?",
        "options": [
            ("Сплавінська Юлія", False),
            ("Бойчук Анастасія", True),
            ("Левченко Данило", False)
        ]
    },
    {
        "text": "Хто Debug and Repair?",
        "options": [
            ("Юрченко Олександр", False),
            ("Деде Петро", False),
            ("Хмельниченко Сергій", True)
        ]
    },
    {
        "text": "Хто відповідає за готову продукцію?",
        "options": [
            ("Бойчук Анастасія", False),
            ("Сплавінська Юлія", True),
            ("Юрченко Олександр", False)
        ]
    },
    {
        "text": "Хто керує Workcell камерами?",
        "options": [
            ("Юрченко Олександр", True),
            ("Левченко Данило", False),
            ("Хмельниченко Сергій", False)
        ]
    },
    {
        "text": "Хто керує Workcell fire?",
        "options": [
            ("Косей Михайло", False),
            ("Левченко Данило", True),
            ("Яремчук Сергій", False)
        ]
    },
    {
        "text": "Хто Production Manager?",
        "options": [
            ("Яремчук Сергій", True),
            ("Косей Михайло", False),
            ("Гала Сергій", False)
        ]
    },
    {
        "text": "Хто Plant Manager?",
        "options": [
            ("Сплавінська Юлія", False),
            ("Косей Михайло", True),
            ("Яремчук Сергій", False)
        ]
    },
    {
        "text": "Які дільниці входять у департамент SMT?",
        "options": [
            ("SMT", True),
            ("Монтаж", False),
            ("Напівфабрикат", False)
        ]
    },
    {
        "text": "Які дільниці входять у департамент Монтаж?",
        "options": [
            ("Селективка-DIP-Laq", True),
            ("Debug and Repair", False),
            ("Готова продукція", False)
        ]
    },
    {
        "text": "Які дільниці входять у департамент Напівфабрикат?",
        "options": [
            ("Test-Складання", True),
            ("SMT", False),
            ("Монтаж", False)
        ]
    },
    {
        "text": "Які дільниці входять у департамент Debug and Repair?",
        "options": [
            ("Assembly Rework-Debug", True),
            ("Готова продукція", False),
            ("Напівфабрикат", False)
        ]
    },
    {
        "text": "Які дільниці входять у департамент Готової продукції?",
        "options": [
            ("Лонг тест-QC/PKG-Мастербокс-Тамподрук-Комплектування", True),
            ("SMT", False),
            ("Монтаж", False)
        ]
    },
    {
        "text": "Хто відповідає за канцелярію та розвозки?",
        "options": [
            ("Ярмоленко Юлія", True),
            ("Леся Пальчук", False),
            ("Віталій Шевченко", False)
        ]
    },
    {
        "text": "Хто відповідає за відсутність кави, молока та смаколики?",
        "options": [
            ("Віталій Шевченко", False),
            ("Оксана Горонді", False),
            ("Ярмоленко Юлія", True)
        ]
    },
    {
        "text": "Хто відповідає, якщо не працює кавова машина?",
        "options": [
            ("Ярмоленко Юлія", True),
            ("Віталій Шевченко", False),
            ("Оксана Горонді", False)
        ]
    },
    {
        "text": "Хто відповідає за халати на виробництві в Гуменне?",
        "options": [
            ("Оксана Горонді", False),
            ("Ярмоленко Юлія", True),
            ("Віталій Шевченко", False)
        ]
    },
    {
        "text": "Хто відповідає за чистоту на виробництві?",
        "options": [
            ("Оксана Горонді", True),
            ("Ярмоленко Юлія", False),
            ("Віталій Шевченко", False)
        ]
    },
    {
        "text": "Хто відповідає за всі завхоз роботи?",
        "options": [
            ("Леся Пальчук", False),
            ("Ярмоленко Юлія", False),
            ("Віталій Шевченко", True)
        ]
    },
    {
        "text": "Хто відповідає за консультації керівників у разі порушення трудової дисципліни?",
        "options": [
            ("HR Lead локації", True),
            ("Head of Department", False),
            ("Безпосередній керівник", False)
        ]
    },
    {
        "text": "Що має зробити безпосередній керівник у разі прогулу працівника?",
        "options": [
            ("Надати пояснення колегам", False),
            ("Зафіксувати прогул в табелі та чаті ЧС", True),
            ("Ігнорувати прогул", False)
        ]
    },
    {
        "text": "Що робить HR Lead локації при порушенні трудової дисципліни?",
        "options": [
            ("Забирає відпустку у працівника", False),
            ("Формує комісію та розслідує інцидент", True),
            ("Складає акт про прогул", False)
        ]
    },
    {
        "text": "Що робить Head of Department при трудових порушеннях на локації?",
        "options": [
            ("Видає штраф працівнику", False),
            ("Повідомляє HR Lead локації про інцидент", True),
            ("Складає доповідну замість працівника", False)
        ]
    },
    {
        "text": "Які дії має виконати безпосередній керівник, якщо працівник з’явився на роботі в нетверезому стані?",
        "options": [
            ("Скласти доповідну, акт відсторонення та направити додому", True),
            ("Повідомити тільки колег", False),
            ("Відпустити його працювати як є", False)
        ]
    }
]
   
