# questions.py

questions = [
    # --- SP QUESTIONS ---
    {
        "text": "Хто має повідомити HR Lead локації про прогул працівника?",
        "options": [
            ("Head of Department", False),
            ("HR Documentation Specialist", False),
            ("Безпосередній керівник", True)
        ]
    },
    {
        "text": "Який документ складає керівник, якщо працівник не вийшов на роботу і відмовляється писати пояснювальну?",
        "options": [
            ("Доповідна записка", False),
            ("Акт відмови надати пояснення", True),
            ("Табель", False)
        ]
    },
    {
        "text": "Хто формує комісію та проводить розслідування інциденту?",
        "options": [
            ("HR Lead локації", True),
            ("Безпосередній керівник", False),
            ("Head of Department", False)
        ]
    },
    # --- QUIZ QUESTIONS ---
    {
        "text": "Як звати Head відділу HR?",
        "options": [
            ("Сільвія Онисько", False),
            ("Ганькович Інеса", True),
            ("Роман Бобинич", False)
        ]
    },
    {
        "text": "Хто Planning lead?",
        "options": [
            ("Дугінова Евгенія", False),
            ("Гала Сергій", False),
            ("Сільвія Онисько", True)
        ]
    },
    # --- INTERVIEW QUESTIONS ---
    {
        "text": "Які дільниці входять у департамент SMT?",
        "options": [
            ("SMT", True),
            ("Монтаж", False),
            ("Напівфабрикат", False)
        ]
    },
    {
        "text": "Які дільниці входять у департамент Монтаж?",
        "options": [
            ("Селективка-DIP-Laq", True),
            ("Debug and Repair", False),
            ("Готова продукція", False)
        ]
    },
    # --- INFRA QUESTIONS ---
    {
        "text": "Хто відповідає за канцелярію та розвозки?",
        "options": [
            ("Ярмоленко Юлія", True),
            ("Леся Пальчук", False),
            ("Віталій Шевченко", False)
        ]
    },
    {
        "text": "Хто відповідає за відсутність кави, молока та смаколики?",
        "options": [
            ("Віталій Шевченко", False),
            ("Оксана Горонді", False),
            ("Ярмоленко Юлія", True)
        ]
    },
    # --- DISCIPLINE QUESTIONS ---
    {
        "text": "Хто відповідає за консультації керівників у разі порушення трудової дисципліни?",
        "options": [
            ("HR Lead локації", True),
            ("Head of Department", False),
            ("Безпосередній керівник", False)
        ]
    },
    {
        "text": "Що має зробити безпосередній керівник у разі прогулу працівника?",
        "options": [
            ("Надати пояснення колегам", False),
            ("Зафіксувати прогул в табелі та чаті ЧС", True),
            ("Ігнорувати прогул", False)
        ]
    }
]
